app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-27 04:54:47.961740"], ["topic_id", 3], ["updated_at", "2014-11-27 04:54:47.961740"]]
---
  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create

INSERT INTO "topics" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-18 09:27:32.724848"], ["description", "This topic is awesome"], ["title", "My Awesome topic"], ["updated_at", "2014-11-18 09:27:32.724848"]]
---
  def create
  @topic = Topic.new(topic_params)

  respond_to do |format|
    if @topic.save

UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = 14  [["description", "I am good at rails :)"], ["updated_at", "2014-11-27 06:15:17.539196"]]
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)